HELP_TXT = '''Дурак - это карточная игра. В ней используется колода из 36 карт.
Каждая карта имеет масть (♥, ♣, ♦, ♠) и достоинство (6, 7, 8, 9, 10, В, Д, К, Т).
Карта высшего достоинства может покрыть любую карту низшего достоинства, если они одной масти.
В начале игры выбирается козырь - масть, обладающая особой силой, стоящая над другими.
Козырная карта может покрыть любую карту иной масти.

В простом режиме можно сделать только один ход, в подкидном - пока позволяет возможность.
Ну что, поехали?'''

HELP_TXT_TTS = '''Дур+ак - это к+арточная игр+а. В ней исп+ользуется кол+ода из тридцат+и шест+и карт.
К+аждая к+арта им+еет м+асть (ч+ерви, кр+ести, б+уби, в+ини) и дост+оинство: от шест+и до туз+а.
К+арта в+ысшего дост+оинства м+ожет покр+ыть люб+ую к+арту н+изшего дост+оинства, +если он+и одн+ой м+асти.
В нач+але игр+ы выбир+ается к+озырь - м+асть, облад+ающая ос+обой с+илой, сто+ящая над друг+ими.
Козырн+ая к+арта м+ожет покр+ыть люб+ую к+арту ин+ой м+асти.

В прост+ом реж+име м+ожно сд+елать только од+ин ход, - в подкидн+ом - пок+а позвол+яет возм+ожность.
Ну что, - по+ехали?'''

WHAT_CAN_YOU_DO = 'Я могу сыграть с тобой в "Дурака". Мой интеллект позволяет мне делать ' \
                  'логичные ходы - крыть и давать карты.'

WHAT_CAN_YOU_DO_TTS = 'Я мог+у сыгр+ать с тоб+ой в "Дурак+а". М+ой интелл+ект позвол+яет мне ' \
                      'д+елать лог+ичные ход+ы - кр+ыть и дав+ать к+арты.'

HELLO = 'Привет! Давай сыграем в "Дурака".' \
            'Для управления используй кнопки. Выбери действие.'

HELLO_TTS = 'Прив+ет! Дав+ай сыгр+аем в "Дурак+а".' \
            'Для управл+ения исп+ользуй кн+опки. В+ыбери д+ействие.'

BYE = 'Надеюсь, было весело. Пока.'
BYE_TTS = 'Над+еюсь, б+ыло в+есело. Пок+а.'

CHOOSE_GAMEMODE = 'Выбери режим игры.'
CHOOSE_GAMEMODE_TTS = 'В+ыбери реж+им игр+ы.'

NOT_UNDERSTANDABLE = 'Не поняла ответа!'
NOT_UNDERSTANDABLE_TTS = 'Не понял+а отв+ета!'

NO_SUCH_MODE = 'Такого режима нет!\nПопробуй ещё раз!'
NO_SUCH_MODE_TTS = 'Так+ого реж+има нет! Попр+обуй ещ+ё раз!'

TRUMP = 'Козырь'
TRUMP_TTS = 'К+озырь -'

THE_SMALLEST_TRUMP = 'Мой самый маленький козырь'
THE_SMALLEST_TRUMP_TTS = 'Мой с+амый м+аленький к+озырь -'

NO_TRUMP = 'У меня нет козырей.'
NO_TRUMP_TTS = 'У мен+я нет козыр+ей.'

COIN = 'Похоже, у нас нет козырей, а самые большие карты одинаковые. Я подкинула монетку'
COIN_TTS = 'Пох+оже, у нас нет козыр+ей, а с+амые больш+ие к+арты один+аковые. Я подк+инула мон+етку'

NO_TRUMPS = 'Похоже, у нас нет козырей. Моя самая большая карта'
NO_TRUMPS_TTS = 'Пох+оже, у нас нет козыр+ей. Мо+я с+амая больш+ая к+арта'

WILL_YOU_ADD = 'Добавишь ещё карту?'
WILL_YOU_ADD_TTS = 'Доб+авишь ещ+ё к+арту?'

NO_SUCH_CARD_AGAIN = 'Нет такой карты. Попробуй ещё раз.'
NO_SUCH_CARD_AGAIN_TTS = 'Нет так+ой к+арты. Попр+обуй ещ+ё раз.'

CANT_RESET = 'Нельзя выполнить сброс.'
CANT_RESET_TTS = 'Нельз+я, в+ыполнить сброс.'

WHICH_CARD = 'Какую карту будешь крыть? Выбери ниже.'
WHICH_CARD_TTS = 'Как+ую к+арту б+удешь крыть? В+ыбери н+иже.'

WHICH_CARD_THEN = 'Какую карту будешь крыть дальше? Выбери ниже.'
WHICH_CARD_THEN_TTS = 'Как+ую к+арту б+удешь крыть д+альше? В+ыбери н+иже.'

CHOOSED_CARD = 'Выбрана карта'
CHOOSED_CARD_TTS = 'В+ыбрана к+арта'

WHAT_TO_COVER = 'Чем будешь крыть?'
WHAT_TO_COVER_TTS = 'Чем б+удешь крыть?'

CARD_LEFT = 'Осталось покрыть'
CARD_LEFT_TTS = 'Ост+алось покр+ыть'

CANT_COVER = 'Эта карта не может покрыть'
CANT_COVER_TTS = '+Эта к+арта не м+ожет покр+ыть'

NO_SUCH_CARD = 'Такой карты нет.'
NO_SUCH_CARD_TTS = 'Так+ой к+арты нет.'

CHOOSE_DOWN = 'Выбери прикрепленную к сообщению карту.'
CHOOSE_DOWN_TTS = 'В+ыбери прикрепл+ённую к сообщ+ению к+арту.'

COVER = 'Кройте'

TAKE = 'Беру.'

BITO_0 = 'Бито. Ваш ход.'
BITO_1 = 'Бито.'

YOUR_MOVE = 'ты ходишь'
YOUR_MOVE_TTS = 'ты х+одишь'

ALISAS_MOVE = 'поэтому я хожу первой'
ALISAS_MOVE_TTS = 'по+этому я хож+у п+ервой'

RESULT_DRAW = [
    ('Ничья!', 'Ничь+я!'),
    ('Победила дружба!', 'Побед+ила - др+ужба!'),
    ('Вничью!', 'Вничь+ю!'),
    ('Мы победили друг друга!', 'Мы побед+или друг др+уга!')
]
RESULT_LOSE = [
    ('Я победила!', 'Я побед+ила'),
    ('Я выиграла!', 'Я в+ыйграла'),
    ('Победа за мной!', 'Поб+еда за мн+ой!'),
    ('Я выиграла, жалкий людишка!', 'Я в+ыйграла, ж+алкий люд+ишка!')
]
RESULT_WIN = [
    ('Вы победили!', 'Вы побед+или!'),
    ('Победа за вами!', 'Поб+еда за в+ами!'),
    ('Вы нанесли мне поражение...', 'Вы нанесл+и мне пораж+ение...')
]

PLAY_AGAIN = 'Сыграем ещё раз?'
PLAY_AGAIN_TTS = 'Сыгр+аем ещ+ё раз'

# Список из строк, которые содержат в себе еще какую-то доп. информацию,
# например, карты. Впоследствие они подвергаются реплейсии
STRINGS_TO_SPEECH = [
    (TRUMP, TRUMP_TTS),
    (THE_SMALLEST_TRUMP, THE_SMALLEST_TRUMP_TTS),
    (NO_TRUMPS, NO_TRUMPS_TTS),
    (COIN, COIN_TTS),
    (CANT_RESET, CANT_RESET_TTS),
    (WHICH_CARD, WHICH_CARD_TTS),
    (CHOOSED_CARD, CHOOSED_CARD_TTS),
    (WHAT_TO_COVER, WHAT_TO_COVER_TTS),
    (CARD_LEFT, CARD_LEFT_TTS),
    (CANT_COVER, CANT_COVER_TTS),
    (CHOOSE_DOWN, CHOOSE_DOWN_TTS),
    (PLAY_AGAIN, PLAY_AGAIN_TTS),
    (YOUR_MOVE, YOUR_MOVE_TTS),
    (ALISAS_MOVE, ALISAS_MOVE_TTS)
] + RESULT_DRAW + RESULT_LOSE + RESULT_WIN